coupled_openfoam_calculix_v2/fluid-openfoam/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{

    p
    {
            
    solver           PCG;
    preconditioner   DIC;
    tolerance        1e-16;
    relTol 	         0;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    pcorr
    {
        $p;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    Phi
    {
        $p;
    }

    "(U|cellDisplacement)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-16;
        relTol          0;
        minIter         2;
    }

    "(U|cellDisplacement)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors 4;
    nNonOrthogonalCorrectors 1;
    tolerance 1.0e-16;
    relTol 0;
    consistent  true;
    correctPhi  true;
    momentumPredictor true; 
    nOuterCorrectors	1;
}


potentialFlow
{
    nNonOrthogonalCorrectors 10;
}
